{
  "title": "Qui suis-je ?",
  "sections": [
    {
      "title": "Étudiant et développeur freelance",
      "content": "Passionné par l'informatique depuis mon plus jeune âge, j'ai naturellement orienté mon parcours vers ce domaine. Actuellement en 5ème année à l'ESIEA, je combine mes études avec une activité de développeur freelance. Cette double expérience me permet d'appliquer mes connaissances théoriques dans des contextes concrets et variés. Par exemple, j'ai développé Gava, une plateforme web pour organiser des tournois de jeux vidéo tout en sensibilisant au cyberharcèlement, en partenariat avec la Maison de Protection des Familles. Je m'efforce de comprendre les besoins de mes clients pour leur proposer des solutions adaptées et efficaces. Mon objectif est de créer des applications et des sites web qui répondent aux attentes des utilisateurs tout en apportant une réelle valeur ajoutée. Chaque projet est une opportunité d'apprendre et d'innover."
    },
    {
      "title": "Futur Expert en Ingénierie Logicielle",
      "content": "Mon ambition est de devenir un développeur full stack capable de répondre aux défis technologiques actuels. Je m'efforce de créer des solutions qui apportent une réelle valeur ajoutée aux utilisateurs. Dans mes projets, je privilégie la performance et la simplicité d'utilisation. Par exemple, j'ai développé TodoApp, une application cross-platform de gestion de tâches avec synchronisation en temps réel et analyses de productivité, utilisant Ionic React et TypeScript. J'optimise mes applications pour qu'elles soient rapides et stables, tout en gardant une expérience utilisateur fluide. Je collabore avec des clients qui me font confiance et me laissent la liberté d'explorer de nouvelles approches. Pour moi, l'essentiel est de créer des logiciels qui servent vraiment et qui sont bien conçus."
    },
    {
      "title": "Projets Professionnels et Personnels",
      "content": "Mes projets professionnels et personnels sont guidés par une même vision : créer des solutions technologiques utiles et innovantes. Dans mon travail, je me concentre sur le développement d'applications qui répondent à des besoins concrets. J'ai eu l'opportunité de travailler sur plusieurs projets intéressants qui m'ont permis d'enrichir mes compétences. Par exemple, j'ai participé au développement de Vidibio, une application mobile innovante pour scanner et analyser les haies agricoles, en collaboration avec une startup agritech. J'ai appris que la réussite d'un projet repose sur une bonne collaboration et une écoute attentive des utilisateurs. En parallèle, je m'investis dans des projets qui me passionnent, comme Theseus, une application web et mobile pour l'enregistrement et l'analyse de réunions virtuelles. Je développe des applications et j'expérimente de nouvelles technologies. Ces projets me permettent d'explorer des idées innovantes et de rester à la pointe de la technologie. Je trouve important de maintenir cet équilibre entre projets professionnels et personnels pour rester créatif et motivé."
    },
    {
      "title": "Passion pour le Développement d'Applications et de Logiciels",
      "content": "Ce qui me passionne dans le développement, c'est de transformer des idées en solutions concrètes et utiles. J'ai exploré différents domaines : sites web, applications mobiles, logiciels d'entreprise. Cette diversité d'expériences m'a permis de comprendre les spécificités de chaque type de projet. Par exemple, j'ai développé Optivex, une application mobile pour UPSA qui digitalise le suivi des livraisons de matières premières, remplaçant un système papier inefficace. Ce que je préfère, c'est trouver le bon équilibre entre innovation et pragmatisme. Chaque projet est un nouveau défi qui me pousse à trouver des solutions créatives. Je m'efforce de créer des outils simples à utiliser mais puissants. Pour moi, l'essentiel est que le logiciel soit efficace et agréable à utiliser."
    },
    {
      "title": "Toujours à l'Avant-Garde Technologique",
      "content": "Dans le domaine du développement, rester à jour est essentiel. Je consacre du temps à suivre les nouvelles tendances, à lire des blogs techniques et à participer à des conférences. Ces événements sont l'occasion d'échanger avec d'autres développeurs et de découvrir de nouvelles approches. Par exemple, dans le projet Theseus, j'ai travaillé avec des technologies modernes comme Kubernetes et des systèmes d'analyse IA pour le traitement audio. Je me forme régulièrement sur de nouvelles technologies, en ligne ou en ateliers. Je teste ces nouvelles connaissances sur des projets personnels avant de les utiliser en production. Cette démarche me permet de proposer à mes clients des solutions modernes et adaptées. Et surtout, j'aime apprendre de nouvelles choses, c'est ce qui rend ce métier passionnant."
    }
  ],
  "profilePicture": {
    "src": "/images/profile_picture.jpg",
    "width": 2316,
    "height": 3088,
    "alt": "Profile picture"
  }
}
