{
  "title": "Qui suis-je ?",
  "sections": [
    {
      "title": "Étudiant et développeur freelance",
      "content": "L'informatique est ma passion depuis que je suis tout petit, donc c'est naturellement que j'ai choisi cette voie. Actuellement en 5ème année à l'ESIEA et, à côté de mes études, je bosse comme développeur freelance. Ça me permet de mettre en pratique ce que j'apprends en cours sur des projets concrets. Par exemple, j'ai créé Gava, une plateforme web pour organiser des tournois de jeux vidéo, tout en parlant du cyberharcèlement, en partenariat avec la Maison de Protection des Familles. J'essaie toujours de bien comprendre ce que veulent mes clients pour leur proposer des solutions simples et efficaces. Mon but, c'est de faire des applis et des sites web qui répondent aux attentes des utilisateurs et qui apportent un vrai plus. Chaque projet, c'est une occasion d'apprendre et de tester de nouvelles choses."
    },
    {
      "title": "Futur Expert en Ingénierie Logicielle",
      "content": "J'ai pour objectif de devenir développeur full stack, capable de gérer tout les aspects d'un projet que ce soit du developpement au deploiement. J'essaie de créer des solutions qui facilitent vraiment la vie des utilisateurs. Quand je développe, je vise la performance et la simplicité d'utilisation. J'ai par exemple développé TodoApp, une appli de gestion de tâches multiplateforme avec synchro en temps réel et des stats de productivité, en utilisant Ionic React et TypeScript. Je fais en sorte que mes applications soient rapides et stables, avec une utilisation super fluide. J'ai la chance de travailler avec des clients qui me font confiance et me laissent essayer de nouvelles approches. Pour moi, le plus important est de créer des logiciels qui servent à quelque chose et qui sont bien faits."
    },
    {
      "title": "Projets Professionnels et Personnels",
      "content": "Je me concentre sur la création de solutions tech utiles et innovantes. J'ai eu la chance de participer à des projets super intéressants qui m'ont permis de progresser. Par exemple, j'ai bossé sur Vidibio, une appli mobile innovante pour scanner et analyser les haies agricoles, avec une startup agritech. J'ai appris que la clé d'un projet réussi, c'est la collaboration et l'écoute des utilisateurs. Je travaille également sur Theseus, une appli web et mobile pour enregistrer et analyser des réunions. Je développe des applis et j'expérimente de nouvelles technologies. Ces projets me permettent d'explorer des idées neuves et de rester à jour. Cette approche s'aligne parfaitement avec mon objectif personnel de renforcer mes compétences en intelligence artificielle et de maîtriser son développement dans des applications concrètes."
    },
    {
      "title": "Passion pour le Développement d'Applications et de Logiciels",
      "content": "Ce qui me plaît le plus dans le développement, c'est de transformer des idées en solutions concrètes. J'ai touché à plein de domaines : sites web, applis mobiles, logiciels pour entreprises. Cette diversité m'a permis de bien saisir les spécificités de chaque type de projet. J'ai par exemple développé Optivex, une appli mobile pour UPSA qui a numérisé le suivi des livraisons de matières premières, remplaçant un système papier pas du tout efficace. Ce que je préfère, c'est trouver le juste milieu entre l'innovation et le côté pratique. Chaque projet est un nouveau challenge qui me pousse à être créatif. J'essaie de créer des outils faciles à utiliser mais super efficaces. Pour moi, l'essentiel, c'est que le logiciel soit performant et agréable à utiliser."
    },
    {
      "title": "Toujours à l'Avant-Garde Technologique",
      "content": "Dans le développement, il faut absolument rester informé. Je passe du temps à suivre les nouvelles tendances, à lire des blogs tech et à aller à des conférences. C'est l'occasion d'échanger avec d'autres développeurs et de découvrir de nouvelles méthodes. Par exemple, sur le projet Theseus, j'ai utilisé des technologies récentes comme Kubernetes et des systèmes d'analyse IA pour le traitement audio. Je me forme régulièrement sur de nouvelles technologies, en ligne ou en ateliers. Je teste ces nouvelles connaissances sur des projets perso avant de les utiliser en production. Ça me permet de proposer à mes clients des solutions modernes et adaptées. Et surtout, j'adore apprendre de nouvelles choses, c'est ce qui rend ce métier si passionnant."
    }
  ],
  "profilePicture": {
    "src": "/images/profile_picture.jpg",
    "width": 2316,
    "height": 3088,
    "alt": "Profile picture"
  }
}
